tests/fixtures/subscription/all-subscriptions.xml

GET https://api.recurly.com/v2/subscriptions HTTP/1.1
X-Api-Version: 2.1
Accept: application/xml
Authorization: Basic YXBpa2V5Og==
User-Agent: {user-agent}


HTTP/1.1 200 OK
X-Records: 1
Content-Type: application/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<subscriptions type="array">
  <subscription 
      href="https://api.recurly.com/v2/subscriptions/123456789012345678901234567890ab">
    <uuid>123456789012345678901234567890ab</uuid>
    <account href="https://api.recurly.com/v2/accounts/subscribemock"/>
    <plan href="https://api.recurly.com/v2/plans/basicplan">
      <plan_code>basicplan</plan_code>
      <name>Basic Plan</name>
    </plan>
    <state>active</state>
    <quantity type="integer">1</quantity>
    <currency>EUR</currency>
    <unit_amount_in_cents type="integer">1000</unit_amount_in_cents>
    <activated_at type="datetime">2011-05-27T07:00:00Z</activated_at>
    <canceled_at nil="nil"></canceled_at>
    <expires_at nil="nil"></expires_at>
    <current_period_started_at type="datetime">2011-06-27T07:00:00Z</current_period_started_at>
    <current_period_ends_at type="datetime">2010-07-27T07:00:00Z</current_period_ends_at>
    <trial_started_at nil="nil"></trial_started_at>
    <trial_ends_at nil="nil"></trial_ends_at>
    <subscription_add_ons type="array">
    </subscription_add_ons>
  </subscription>
</subscriptions>
